app/controllers/foods_controller.rb

SELECT "foods".* FROM "foods"
---
  def index
    @foods = Food.all

INSERT INTO "foods" ("name", "cuisine", "calories", "price", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Toast"], ["cuisine", "western"], ["calories", 100], ["price", 1.0], ["created_at", "2019-02-06 05:45:44.323543"], ["updated_at", "2019-02-06 05:45:44.323543"]]
---
  def create
    @food = Food.new(food_params)

    respond_to do |format|
      if @food.save

UPDATE "foods" SET "name" = $1, "updated_at" = $2 WHERE "foods"."id" = $3  [["name", "Nasi Lemak"], ["updated_at", "2019-02-06 07:58:45.769238"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @food.update(food_params)

DELETE FROM "foods" WHERE "foods"."id" = $1  [["id", 1]]
---
  def destroy
    @food.destroy

SELECT  "foods".* FROM "foods" WHERE "foods"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_food
      @food = Food.find(params[:id])