app/controllers/food_meals_controller.rb

SELECT "food_meals".* FROM "food_meals"
---
  def index
    @food_meals = FoodMeal.all

INSERT INTO "food_meals" ("meal_id", "breakfast_id", "lunch_id", "dinner_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["meal_id", 1], ["breakfast_id", 1], ["lunch_id", 1], ["dinner_id", 1], ["created_at", "2019-02-04 03:24:55.258126"], ["updated_at", "2019-02-04 03:24:55.258126"]]
---
  def create
    @food_meal = FoodMeal.new(food_meal_params)

    respond_to do |format|
      if @food_meal.save

DELETE FROM "food_meals" WHERE "food_meals"."id" = $1  [["id", 1]]
---
  def destroy
    @food_meal.destroy

SELECT  "meals".* FROM "meals" WHERE "meals"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "food_meals".* FROM "food_meals" WHERE "food_meals"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_food_meal
      @food_meal = FoodMeal.find(params[:id])