app/controllers/meals_controller.rb

SELECT "meals".* FROM "meals"
---
  def index
    @meals = Meal.all

INSERT INTO "meals" ("date", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["date", "2019-02-03 08:21:00"], ["created_at", "2019-02-03 08:23:27.819589"], ["updated_at", "2019-02-03 08:23:27.819589"]]
---
  def create
    @meal = Meal.new(meal_params)

    respond_to do |format|
      if @meal.save

SELECT  "meals".* FROM "meals" WHERE "meals"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_meal
      @meal = Meal.find(params[:id])