app/controllers/plans_controller.rb

SELECT DISTINCT "foods"."cuisine" FROM "foods"
---
  def index
    @foods = Food.select(:cuisine).distinct

SELECT "plans".* FROM "plans"
SELECT "foods".* FROM "foods" WHERE "foods"."cuisine" = $1  [["cuisine", "Korean"]]
---
  def listing
    @plans = Plan.all
    @foods_b = Food.where(cuisine: params[:foods][:bf_id])

SELECT "plans".* FROM "plans"
SELECT "foods".* FROM "foods"
---
  def profile
    @plans = Plan.all
    @foods = Food.all

SELECT  "plans".* FROM "plans" WHERE "plans"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]
SELECT "foods".* FROM "foods"
---
  def show
    @plans = Plan.find(params[:id])
    @foods = Food.all

SELECT "foods".* FROM "foods"
---
  def new
    @plan = Plan.new
    @foods = Food.all

SELECT  "plans".* FROM "plans" WHERE "plans"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "foods".* FROM "foods"
---
  def edit
    @plans = Plan.find(params[:id])
    @foods = Food.all

INSERT INTO "plans" ("date", "food_id", "lunch_id", "dinner_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["date", "2019-02-08"], ["food_id", 1], ["lunch_id", 4], ["dinner_id", 6], ["created_at", "2019-02-08 07:04:31.807959"], ["updated_at", "2019-02-08 07:04:31.807959"]]
---
  def create
    @plan = Plan.new(plan_params)

    respond_to do |format|
      if @plan.save

UPDATE "plans" SET "dinner_id" = $1, "updated_at" = $2 WHERE "plans"."id" = $3  [["dinner_id", 2], ["updated_at", "2019-02-07 07:08:40.997570"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @plan.update(plan_params)

SELECT  "plans".* FROM "plans" WHERE "plans"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "plans" WHERE "plans"."id" = $1  [["id", 7]]
---
  def destroy
    @plan = Plan.find(params[:id])
    @plan.destroy

SELECT  "plans".* FROM "plans" WHERE "plans"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]
---
    def set_plan
      @plan = Plan.find(params[:id])