app/controllers/plans_controller.rb

  def listing
    @plans = Plan.all
    @foods = Food.all
---
SELECT "foods".* FROM "foods"

  def update

    @plan = Plan.find(params[:id])
---
SELECT  "plans".* FROM "plans" WHERE "plans"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]